// Это компонент списка сотрудников

// Сюда импортируем компонет который будет содержать ин-ю о сотруднике
// Основной компонет будет ипортирован в App вместе с 3 внутренними

// Это элемент списка и он будет находится в ul списке
// Поэтому мы импортируем этот компонент сюда
// так мы его переиспользуем

// app-list дополнительно стилизуем

import EmployeesListItem from '../employees-list-item/employees-list-item.js';

import './employees-list.css';

// Применение компонентов с заданными св-ми
// Мы передали сюда массив Бд data из app.js и можем тут с ним работать

// Нужно перебрать этот массив и вернуть новый массив с
// Логика:
//      1) В компонент приходит массив с оъектами data из app.js
//      2) Тк в пропсах все поступает как объект мы применяем деструктуризацию
//      3) {data} - деструктуризация. Мы получаем массив data из объекта и с ним работаем
// На его основании динамически формируются списки
const EmployeesList = ({data, onDelete, onToggleIncrease, onToggleRise}) => {

    // Создаем переменную и внее будет помещен новый массив от data.map()
    // Массив содержит компонент EmployeesListItem с данными от перебираемого объекта (item) который лежит в массиве ()
    const elements = data.map(item => {

        // Частичная деструктуризация
        // По частям вытаскиваем ID который пойдет в key и ...itemProps как оставшиеся параметры
        // И так же можем использвать их как пропсы при добавлении компонента
        const {id, ...itemProps} = item;

        return (
            // <EmployeesListItem name={item.name} salary={item.salary} increase={item.increase}/>
            // Можно использовать оператор spread (...) и эта запись будет аналогична
            // Так можно не указывать новые свойства которые могут появится

            // Корзинка находится по иерархии ниже чем удаляемы св-ва
            // Чтобы удалять по клику на корзинку элементы мы должна связать их передав вместе с пропсами ф-ю удаления onDelete()
            // Внутри <EmployeesListItem с ней уже работать.
            // Зададим ему так же св-во ф-ю onDelete()
            // Ведь у компонентов должны быть св-ва

            // Id берем в этом компоненте. Из деструктуризированного объекта. Ф-я onDelete будет вызываться с этим id
            // Те когда создается item из метода map() он создается со своим id в key и плюс
            // Каждый item будет создан с методом onDelete(id) со своим собственным id

            // По аналогии работют и методы onToggle()
            <EmployeesListItem 
                key={id} 
                {...itemProps} 
                onDelete={() => onDelete(id)}
                onToggleIncrease={() => onToggleIncrease(id)}
                onToggleRise={() => onToggleRise(id)}/>
        );
    })

    // Возвращаем elements (это новый массив) он содержить компоненты готовые
    // Эти компоненты развернутся и сформируют вёрстку
    return (
        <ul className="app-list list-group">
            {elements}
        </ul>
    );
}

export default EmployeesList;